lists/addRecordToList.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:addRecordToList>

            <listName>test list</listName><listUpdateSettings>

            <fieldsMapping>
                <columnNumber>1</columnNumber>

                <fieldName>number1</fieldName><key>true</key>
            </fieldsMapping>
            <fieldsMapping><columnNumber>2</columnNumber>
                <fieldName>first_name</fieldName><key>false</key>
            </fieldsMapping>
            <crmAddMode>ADD_NEW</crmAddMode>
            <crmUpdateMode>UPDATE_FIRST</crmUpdateMode>
            <listAddMode>ADD_FIRST</listAddMode>
        </listUpdateSettings>
            <record>
                <fields>5551112244</fields>
                <fields>Betty2</fields>
            </record>

            <record>
                <fields>9999999999</fields>
                <fields>afffffff</fields>
            </record>
        </ser:addRecordToList>
    </soapenv:Body>
</soapenv:Envelope>




<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.admin.ws.five9.com/v2/">
<SOAP-ENV:Body>
    <ns1:addRecordToList>
        <listName>test list</listName>
        <listUpdateSettings>
            <fieldsMapping>
                <columnNumber>1</columnNumber>
                <fieldName>number1</fieldName>
                <key>true</key>
            </fieldsMapping>
            <fieldsMapping>
                <columnNumber>2</columnNumber>
                <fieldName>first_name</fieldName>
                <key>false</key>
            </fieldsMapping>
            <fieldsMapping>
                <columnNumber>3</columnNumber>
                <fieldName>last_name</fieldName>
                <key>false</key>
            </fieldsMapping>
            <skipHeaderLine>false</skipHeaderLine>
            <cleanListBeforeUpdate>false</cleanListBeforeUpdate>
            <crmAddMode>ADD_NEW</crmAddMode>
            <crmUpdateMode>UPDATE_FIRST</crmUpdateMode>
            <listAddMode>ADD_FIRST</listAddMode>
        </listUpdateSettings>
        <record>
            <fields>4444444444</fields>
            <fields>Don</fields>
            <fields>Draper</fields>
        </record>
    </ns1:addRecordToList>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>